public enum Week {
    ДУЙШОМБУ("Дуйшомбу  куну java теория сабагын окуйм"),
    ШЕЙШЕМБИ("Шейшемби куну англис тили сабагын окуйм"),
    ШАРШЕМБИ("Шаршемби куну java теория сабагын окуйм "),
    БЕЙШЕМБИ("Бейшемби куну java практика сабагын окуйм"),
    ЖУМА("Жума куну java теория сабагын окуйм"),
    ИШЕМБИ("Ишемби куну java практика сабагын окуйм"),
    ЖЕКШЕМБИ("Жекшемби дем алыш куну");

    private String weekdays;

    Week(String weekdays) {
        this.weekdays = weekdays;
    }

    @Override
    public String toString() {
        return "Сиз тандаган " +
                "кун: " + weekdays;
    }
}
